// 2. Створіть проект validator з формою вводу даних 

let regexp = /^[a-zA-Z_][a-zA-Z_0-9]+$/;
let btn = document.getElementById('btn');

btn.addEventListener('click', function(event){
	event.preventDefault();
	let namefield = document.getElementById('fname').value;

	if (regexp.test(namefield)){
		console.log('Good!');
	}
});

/* 3. Напишіть функцію валідації імені, ім'я повинно складатися лише з латинських літер, 
			без пробілів, перша літера велика. */

// 	function validName(s){
// 	  var err = 'Невірний формат імені!\nФормат: латинські літери, перша - велика.';
// 		 alert(err);
// 	  return true або false;
// }

/* 4. Напишіть функцію валідації e-mail.
		Логін повинен складатися з латинських символів, символів мінус, підкреслювання та крапка.
		Домен повинен складатися лише з латинських символів.
		Доменна зона може складатися з 2-5 латинських символів.
		Регістр не має значення. */

/* 5. Напишіть функцію валідації телефона. Пробіли, дужки, мінуси, можуть бути відсутні.
	 +380 - обов'язкові цифри, приймаються телефони лише України, 12 цифр. */

// 6. Створіть валідатор форми, напишіть алгоритм валідатора та створіть код по алгоритму: